package Homework1;

/**
 * Created by kovalevskyi.i on 10/5/2015.
 * Home task 5 - Счастливые билеты (полностью из инета)
 */

public class LuckyTickets {
    public static void main(String[] args) {

                //Создадим переменную, в которую будем заносить количество счастливых билетиков
                int b=0;
                //С помощью простого цикла и деления по модулю получим значения всех совпадений. Увеличиваем "счетчик"
                // каждый раз, когда сумма первых 3 чисел равна сумме второй тройки. Так как минимальное такое число
                // может быть только после 1000, начинаем цикл с нее
                for(int i=1;i<=999999;i++){
                    int i1=i/100000%10;
                    int i2=i/10000%10;
                    int i3=i/1000%10;
                    int i4=i/100%10;
                    int i5=i/10%10;
                    int i6=i%10;
                    if((i1+i2+i3)==(i4+i5+i6)){
                        b++;
                    }
                }
                System.out.println(b);
            }
    }